In [1]:
import interview_questions, warm_up
import random
import datetime
import pandas as pd
import numpy as np
import torch
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)

In [2]:
df = pd.read_csv('06-26-2020.csv') # dataset for coding warmup
df.to_sql('june_corona', con=engine)
questions = interview_questions.questions
warmUp = warm_up.questions
data = [q for q in questions.items()]
warmUpQuestions = [q for q in warmUp.items()]

https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_sql.html#pandas-equivalents-for-some-sql-analytic-and-aggregate-functions

In [3]:
# join warmups
url1 = 'https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports/12-31-2020.csv'
url2 = 'https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports/12-27-2020.csv'

In [4]:
#day1 = pd.read_csv(url1)
#day2 = pd.read_csv(url2)

In [5]:
results = {}

def trackAnswers(result, question):
    datetime_object = datetime.datetime.now()
    if result:
        results[datetime_object] = (question, 'T')
    results[datetime_object] = (question, 'T')

# add in some probability questions
def quiz_question():
    q = data[random.randint(0,2)]
    print(q[0])
    answer = input()
    if answer == q[1]:
        print('good job', trackAnswers(True, q[0]))
    else:    
        print(f'wrong answer {q[1]}', trackAnswers(False, q[0]))

# make it so this does not repeat questions
# add in some probability questions
def warm_up_question():
    tot_q = len(warmUpQuestions)
    for n,i in enumerate(range(5)):
        try:
            q = warmUpQuestions[random.randint(0,tot_q-1)]
            print(str(n+1) + " " + q[1] + '\n')
        except:
            print(f'ERROR: {tot_q}')

In [6]:
#quiz_question()
#engine.execute("SELECT Admin2 FROM june_corona").fetchall()

##### Warm-up

In [7]:
warm_up_question()

1 sql: create a table and insert values

2 ssh into @bandit.labs.overthewire.org with username bandit0, port 2220 and pw: bandit0

3 return the summary statistics of the column

4 sql: total time spend by each employee: https://leetcode.com/problems/find-total-time-spent-by-each-employee/submissions/

5 reorder the column names by alphabetical order and reverse alpha order

In [8]:
df1 = pd.DataFrame({'key':['A','B','C','D'],'value':np.random.randn(4)})
df2 = pd.DataFrame({'key':['B','D','D','E'],'value':np.random.randn(4)})

In [10]:
pd.merge(df1, df2, on='key')

  key   value_x   value_y
0   B  0.007801 -1.123426
1   D  0.784333  0.991502
2   D  0.784333  1.435913

In [12]:
df1.to_sql('df1', con=engine)
df2.to_sql('df2', con=engine)

In [14]:
engine.execute(
    '''
    select *
    from df1
    join df2 on df1.key = df2.key;
    '''
).fetchall()

[(1, 'B', 0.00780140892297036, 0, 'B', -1.1234259910536837),
 (3, 'D', 0.7843332734781189, 1, 'D', 0.9915021219140007),
 (3, 'D', 0.7843332734781189, 2, 'D', 1.4359126228037398)]

In [15]:
pd.merge(df1, df2, on='key', how='left')

  key   value_x   value_y
0   A  1.438991       NaN
1   B  0.007801 -1.123426
2   C -1.153260       NaN
3   D  0.784333  0.991502
4   D  0.784333  1.435913

In [16]:
engine.execute(
    '''
    select * 
    from df1
    left join df2 on df1.key = df2.key;
    '''
).fetchall()

[(0, 'A', 1.438990592232384, None, None, None),
 (1, 'B', 0.00780140892297036, 0, 'B', -1.1234259910536837),
 (2, 'C', -1.1532597498662258, None, None, None),
 (3, 'D', 0.7843332734781189, 1, 'D', 0.9915021219140007),
 (3, 'D', 0.7843332734781189, 2, 'D', 1.4359126228037398)]

In [17]:
pd.merge(df1, df2, on='key', how='right')

  key   value_x   value_y
0   B  0.007801 -1.123426
1   D  0.784333  0.991502
2   D  0.784333  1.435913
3   E       NaN  3.399846

In [19]:
df.loc[:,'Admin2'].describe()

count           3107
unique          1801
top       Unassigned
freq              50
Name: Admin2, dtype: object

In [26]:
df.loc[:,'Deaths'].describe()

count     3788.000000
mean       130.462249
std       1075.882839
min          0.000000
25%          0.000000
50%          2.000000
75%         18.000000
max      38888.000000
Name: Deaths, dtype: float64

In [30]:
df[sorted(df.columns, reverse=True)]

,Recovered,Province_State,Long_,Lat,Last_Update,Incidence_Rate,FIPS,Deaths,Country_Region,Confirmed,Combined_Key,Case-Fatality_Ratio,Admin2,Active
0,0,South Carolina,-82.461707,34.223334,2020-06-27 04:33:35,407.713948,45001.0,0,US,100,"Abbeville, South Carolina, US",0.000000,Abbeville,100
1,0,Louisiana,-92.414197,30.295065,2020-06-27 04:33:35,1261.987267,22001.0,36,US,783,"Acadia, Louisiana, US",4.597701,Acadia,747
2,0,Virginia,-75.632346,37.767072,2020-06-27 04:33:35,3208.936750,51001.0,14,US,1037,"Accomack, Virginia, US",1.350048,Accomack,1023
3,0,Idaho,-116.241552,43.452658,2020-06-27 04:33:35,329.120180,16001.0,23,US,1585,"Ada, Idaho, US",1.451104,Ada,1562
4,0,Iowa,-94.471059,41.330756,2020-06-27 03:33:36,195.749441,19001.0,0,US,14,"Adair, Iowa, US",0.000000,Adair,14
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3783,1233,NaN,27.849332,-13.133897,2020-06-27 04:33:35,8.327914,NaN,21,Zambia,1531,Zambia,1.371653,NaN,277
3784,135,NaN,29.154857,-19.015438,2020-06-27 04:33:35,3.774492,NaN,6,Zimbabwe,561,Zimbabwe,1.069519,NaN,420
3785,0,Alaska,-162.890520,60.388600,2021-04-02 15:13:53,NaN,2066.0,0,US,1,"Copper River, Alaska, US",NaN,Copper River,0
3786,0,Alaska,-149.900000,61.166660,2021-04-02 15:13:53,NaN,2063.0,0,US,18,"Chugach, Alaska, US",NaN,Chugach,0
3787,0,Unknown,NaN,NaN,2020-06-27 04:33:35,0.000000,NaN,0,China,0,"Unknown, China",0.000000,NaN,0